espressif/esp-idf/components/soc/esp32h4/include/modem/modem_syscon_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "modem/reg_base.h"
#ifdef __cplusplus
extern "C" {
#endif

/* MODEM_SYSCON_TEST_CONF_REG register */
#define MODEM_SYSCON_TEST_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x0)
/* MODEM_SYSCON_CLK_EN : R/W; bitpos: [0]; default: 0; */
#define MODEM_SYSCON_CLK_EN    (BIT(0))
#define MODEM_SYSCON_CLK_EN_M  (MODEM_SYSCON_CLK_EN_V << MODEM_SYSCON_CLK_EN_S)
#define MODEM_SYSCON_CLK_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_EN_S  0
/* MODEM_SYSCON_MODEM_ANT_FORCE_SEL_BT : R/W; bitpos: [1]; default: 0; */
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_BT    (BIT(1))
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_BT_M  (MODEM_SYSCON_MODEM_ANT_FORCE_SEL_BT_V << MODEM_SYSCON_MODEM_ANT_FORCE_SEL_BT_S)
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_BT_V  0x00000001U
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_BT_S  1
/* MODEM_SYSCON_MODEM_ANT_FORCE_SEL_WIFI : R/W; bitpos: [2]; default: 0; */
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_WIFI    (BIT(2))
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_WIFI_M  (MODEM_SYSCON_MODEM_ANT_FORCE_SEL_WIFI_V << MODEM_SYSCON_MODEM_ANT_FORCE_SEL_WIFI_S)
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_WIFI_V  0x00000001U
#define MODEM_SYSCON_MODEM_ANT_FORCE_SEL_WIFI_S  2
/* MODEM_SYSCON_FPGA_DEBUG_CLKSWITCH : R/W; bitpos: [3]; default: 0; */
#define MODEM_SYSCON_FPGA_DEBUG_CLKSWITCH    (BIT(3))
#define MODEM_SYSCON_FPGA_DEBUG_CLKSWITCH_M  (MODEM_SYSCON_FPGA_DEBUG_CLKSWITCH_V << MODEM_SYSCON_FPGA_DEBUG_CLKSWITCH_S)
#define MODEM_SYSCON_FPGA_DEBUG_CLKSWITCH_V  0x00000001U
#define MODEM_SYSCON_FPGA_DEBUG_CLKSWITCH_S  3
/* MODEM_SYSCON_FPGA_DEBUG_CLK80 : R/W; bitpos: [4]; default: 0; */
#define MODEM_SYSCON_FPGA_DEBUG_CLK80    (BIT(4))
#define MODEM_SYSCON_FPGA_DEBUG_CLK80_M  (MODEM_SYSCON_FPGA_DEBUG_CLK80_V << MODEM_SYSCON_FPGA_DEBUG_CLK80_S)
#define MODEM_SYSCON_FPGA_DEBUG_CLK80_V  0x00000001U
#define MODEM_SYSCON_FPGA_DEBUG_CLK80_S  4
/* MODEM_SYSCON_FPGA_DEBUG_CLK40 : R/W; bitpos: [5]; default: 0; */
#define MODEM_SYSCON_FPGA_DEBUG_CLK40    (BIT(5))
#define MODEM_SYSCON_FPGA_DEBUG_CLK40_M  (MODEM_SYSCON_FPGA_DEBUG_CLK40_V << MODEM_SYSCON_FPGA_DEBUG_CLK40_S)
#define MODEM_SYSCON_FPGA_DEBUG_CLK40_V  0x00000001U
#define MODEM_SYSCON_FPGA_DEBUG_CLK40_S  5
/* MODEM_SYSCON_FPGA_DEBUG_CLK20 : R/W; bitpos: [6]; default: 0; */
#define MODEM_SYSCON_FPGA_DEBUG_CLK20    (BIT(6))
#define MODEM_SYSCON_FPGA_DEBUG_CLK20_M  (MODEM_SYSCON_FPGA_DEBUG_CLK20_V << MODEM_SYSCON_FPGA_DEBUG_CLK20_S)
#define MODEM_SYSCON_FPGA_DEBUG_CLK20_V  0x00000001U
#define MODEM_SYSCON_FPGA_DEBUG_CLK20_S  6
/* MODEM_SYSCON_FPGA_DEBUG_CLK10 : R/W; bitpos: [7]; default: 0; */
#define MODEM_SYSCON_FPGA_DEBUG_CLK10    (BIT(7))
#define MODEM_SYSCON_FPGA_DEBUG_CLK10_M  (MODEM_SYSCON_FPGA_DEBUG_CLK10_V << MODEM_SYSCON_FPGA_DEBUG_CLK10_S)
#define MODEM_SYSCON_FPGA_DEBUG_CLK10_V  0x00000001U
#define MODEM_SYSCON_FPGA_DEBUG_CLK10_S  7
/* MODEM_SYSCON_MODEM_MEM_MODE_FORCE : R/W; bitpos: [8]; default: 1; */
#define MODEM_SYSCON_MODEM_MEM_MODE_FORCE    (BIT(8))
#define MODEM_SYSCON_MODEM_MEM_MODE_FORCE_M  (MODEM_SYSCON_MODEM_MEM_MODE_FORCE_V << MODEM_SYSCON_MODEM_MEM_MODE_FORCE_S)
#define MODEM_SYSCON_MODEM_MEM_MODE_FORCE_V  0x00000001U
#define MODEM_SYSCON_MODEM_MEM_MODE_FORCE_S  8

/* MODEM_SYSCON_CLK_CONF_REG register */
#define MODEM_SYSCON_CLK_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x4)
/* MODEM_SYSCON_PWDET_SAR_CLOCK_ENA : R/W; bitpos: [0]; default: 0; */
#define MODEM_SYSCON_PWDET_SAR_CLOCK_ENA    (BIT(0))
#define MODEM_SYSCON_PWDET_SAR_CLOCK_ENA_M  (MODEM_SYSCON_PWDET_SAR_CLOCK_ENA_V << MODEM_SYSCON_PWDET_SAR_CLOCK_ENA_S)
#define MODEM_SYSCON_PWDET_SAR_CLOCK_ENA_V  0x00000001U
#define MODEM_SYSCON_PWDET_SAR_CLOCK_ENA_S  0
/* MODEM_SYSCON_PWDET_CLK_DIV_NUM : R/W; bitpos: [8:1]; default: 1; */
#define MODEM_SYSCON_PWDET_CLK_DIV_NUM    0x000000FFU
#define MODEM_SYSCON_PWDET_CLK_DIV_NUM_M  (MODEM_SYSCON_PWDET_CLK_DIV_NUM_V << MODEM_SYSCON_PWDET_CLK_DIV_NUM_S)
#define MODEM_SYSCON_PWDET_CLK_DIV_NUM_V  0x000000FFU
#define MODEM_SYSCON_PWDET_CLK_DIV_NUM_S  1
/* MODEM_SYSCON_CLK_TX_DAC_INV_ENA : R/W; bitpos: [9]; default: 0; */
#define MODEM_SYSCON_CLK_TX_DAC_INV_ENA    (BIT(9))
#define MODEM_SYSCON_CLK_TX_DAC_INV_ENA_M  (MODEM_SYSCON_CLK_TX_DAC_INV_ENA_V << MODEM_SYSCON_CLK_TX_DAC_INV_ENA_S)
#define MODEM_SYSCON_CLK_TX_DAC_INV_ENA_V  0x00000001U
#define MODEM_SYSCON_CLK_TX_DAC_INV_ENA_S  9
/* MODEM_SYSCON_CLK_RX_ADC_INV_ENA : R/W; bitpos: [10]; default: 0; */
#define MODEM_SYSCON_CLK_RX_ADC_INV_ENA    (BIT(10))
#define MODEM_SYSCON_CLK_RX_ADC_INV_ENA_M  (MODEM_SYSCON_CLK_RX_ADC_INV_ENA_V << MODEM_SYSCON_CLK_RX_ADC_INV_ENA_S)
#define MODEM_SYSCON_CLK_RX_ADC_INV_ENA_V  0x00000001U
#define MODEM_SYSCON_CLK_RX_ADC_INV_ENA_S  10
/* MODEM_SYSCON_CLK_PWDET_ADC_INV_ENA : R/W; bitpos: [11]; default: 0; */
#define MODEM_SYSCON_CLK_PWDET_ADC_INV_ENA    (BIT(11))
#define MODEM_SYSCON_CLK_PWDET_ADC_INV_ENA_M  (MODEM_SYSCON_CLK_PWDET_ADC_INV_ENA_V << MODEM_SYSCON_CLK_PWDET_ADC_INV_ENA_S)
#define MODEM_SYSCON_CLK_PWDET_ADC_INV_ENA_V  0x00000001U
#define MODEM_SYSCON_CLK_PWDET_ADC_INV_ENA_S  11
/* MODEM_SYSCON_CLK_I2C_MST_SEL_160M : R/W; bitpos: [12]; default: 0; */
#define MODEM_SYSCON_CLK_I2C_MST_SEL_160M    (BIT(12))
#define MODEM_SYSCON_CLK_I2C_MST_SEL_160M_M  (MODEM_SYSCON_CLK_I2C_MST_SEL_160M_V << MODEM_SYSCON_CLK_I2C_MST_SEL_160M_S)
#define MODEM_SYSCON_CLK_I2C_MST_SEL_160M_V  0x00000001U
#define MODEM_SYSCON_CLK_I2C_MST_SEL_160M_S  12
/* MODEM_SYSCON_CLK_DATA_DUMP_MUX : R/W; bitpos: [21]; default: 0; */
#define MODEM_SYSCON_CLK_DATA_DUMP_MUX    (BIT(21))
#define MODEM_SYSCON_CLK_DATA_DUMP_MUX_M  (MODEM_SYSCON_CLK_DATA_DUMP_MUX_V << MODEM_SYSCON_CLK_DATA_DUMP_MUX_S)
#define MODEM_SYSCON_CLK_DATA_DUMP_MUX_V  0x00000001U
#define MODEM_SYSCON_CLK_DATA_DUMP_MUX_S  21
/* MODEM_SYSCON_CLK_ETM_EN : R/W; bitpos: [22]; default: 0; */
#define MODEM_SYSCON_CLK_ETM_EN    (BIT(22))
#define MODEM_SYSCON_CLK_ETM_EN_M  (MODEM_SYSCON_CLK_ETM_EN_V << MODEM_SYSCON_CLK_ETM_EN_S)
#define MODEM_SYSCON_CLK_ETM_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_ETM_EN_S  22
/* MODEM_SYSCON_CLK_ZB_APB_EN : R/W; bitpos: [23]; default: 0; */
#define MODEM_SYSCON_CLK_ZB_APB_EN    (BIT(23))
#define MODEM_SYSCON_CLK_ZB_APB_EN_M  (MODEM_SYSCON_CLK_ZB_APB_EN_V << MODEM_SYSCON_CLK_ZB_APB_EN_S)
#define MODEM_SYSCON_CLK_ZB_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_ZB_APB_EN_S  23
/* MODEM_SYSCON_CLK_ZBMAC_EN : R/W; bitpos: [24]; default: 0; */
#define MODEM_SYSCON_CLK_ZBMAC_EN    (BIT(24))
#define MODEM_SYSCON_CLK_ZBMAC_EN_M  (MODEM_SYSCON_CLK_ZBMAC_EN_V << MODEM_SYSCON_CLK_ZBMAC_EN_S)
#define MODEM_SYSCON_CLK_ZBMAC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_ZBMAC_EN_S  24
/* MODEM_SYSCON_CLK_MODEM_SEC_ECB_EN : R/W; bitpos: [25]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_EN    (BIT(25))
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_EN_M  (MODEM_SYSCON_CLK_MODEM_SEC_ECB_EN_V << MODEM_SYSCON_CLK_MODEM_SEC_ECB_EN_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_EN_S  25
/* MODEM_SYSCON_CLK_MODEM_SEC_CCM_EN : R/W; bitpos: [26]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_EN    (BIT(26))
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_EN_M  (MODEM_SYSCON_CLK_MODEM_SEC_CCM_EN_V << MODEM_SYSCON_CLK_MODEM_SEC_CCM_EN_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_EN_S  26
/* MODEM_SYSCON_CLK_MODEM_SEC_BAH_EN : R/W; bitpos: [27]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_EN    (BIT(27))
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_EN_M  (MODEM_SYSCON_CLK_MODEM_SEC_BAH_EN_V << MODEM_SYSCON_CLK_MODEM_SEC_BAH_EN_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_EN_S  27
/* MODEM_SYSCON_CLK_MODEM_SEC_APB_EN : R/W; bitpos: [28]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_EN    (BIT(28))
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_EN_M  (MODEM_SYSCON_CLK_MODEM_SEC_APB_EN_V << MODEM_SYSCON_CLK_MODEM_SEC_APB_EN_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_EN_S  28
/* MODEM_SYSCON_CLK_MODEM_SEC_EN : R/W; bitpos: [29]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_EN    (BIT(29))
#define MODEM_SYSCON_CLK_MODEM_SEC_EN_M  (MODEM_SYSCON_CLK_MODEM_SEC_EN_V << MODEM_SYSCON_CLK_MODEM_SEC_EN_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_EN_S  29
/* MODEM_SYSCON_CLK_BLE_TIMER_EN : R/W; bitpos: [30]; default: 0; */
#define MODEM_SYSCON_CLK_BLE_TIMER_EN    (BIT(30))
#define MODEM_SYSCON_CLK_BLE_TIMER_EN_M  (MODEM_SYSCON_CLK_BLE_TIMER_EN_V << MODEM_SYSCON_CLK_BLE_TIMER_EN_S)
#define MODEM_SYSCON_CLK_BLE_TIMER_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_BLE_TIMER_EN_S  30
/* MODEM_SYSCON_CLK_DATA_DUMP_EN : R/W; bitpos: [31]; default: 0; */
#define MODEM_SYSCON_CLK_DATA_DUMP_EN    (BIT(31))
#define MODEM_SYSCON_CLK_DATA_DUMP_EN_M  (MODEM_SYSCON_CLK_DATA_DUMP_EN_V << MODEM_SYSCON_CLK_DATA_DUMP_EN_S)
#define MODEM_SYSCON_CLK_DATA_DUMP_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_DATA_DUMP_EN_S  31

/* MODEM_SYSCON_CLK_CONF_FORCE_ON_REG register */
#define MODEM_SYSCON_CLK_CONF_FORCE_ON_REG (DR_REG_MODEM_SYSCON_BASE + 0x8)
/* MODEM_SYSCON_CLK_AON_FO : R/W; bitpos: [0]; default: 0; */
#define MODEM_SYSCON_CLK_AON_FO    (BIT(0))
#define MODEM_SYSCON_CLK_AON_FO_M  (MODEM_SYSCON_CLK_AON_FO_V << MODEM_SYSCON_CLK_AON_FO_S)
#define MODEM_SYSCON_CLK_AON_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_AON_FO_S  0
/* MODEM_SYSCON_CLK_PLL_FO : R/W; bitpos: [1]; default: 0; */
#define MODEM_SYSCON_CLK_PLL_FO    (BIT(1))
#define MODEM_SYSCON_CLK_PLL_FO_M  (MODEM_SYSCON_CLK_PLL_FO_V << MODEM_SYSCON_CLK_PLL_FO_S)
#define MODEM_SYSCON_CLK_PLL_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_PLL_FO_S  1
/* MODEM_SYSCON_CLK_MODEM_SEC_FO : R/W; bitpos: [2]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_FO    (BIT(2))
#define MODEM_SYSCON_CLK_MODEM_SEC_FO_M  (MODEM_SYSCON_CLK_MODEM_SEC_FO_V << MODEM_SYSCON_CLK_MODEM_SEC_FO_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_FO_S  2
/* MODEM_SYSCON_CLK_MODEM_SEC_ECB_FO : R/W; bitpos: [3]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_FO    (BIT(3))
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_FO_M  (MODEM_SYSCON_CLK_MODEM_SEC_ECB_FO_V << MODEM_SYSCON_CLK_MODEM_SEC_ECB_FO_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_ECB_FO_S  3
/* MODEM_SYSCON_CLK_MODEM_SEC_CCM_FO : R/W; bitpos: [4]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_FO    (BIT(4))
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_FO_M  (MODEM_SYSCON_CLK_MODEM_SEC_CCM_FO_V << MODEM_SYSCON_CLK_MODEM_SEC_CCM_FO_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_CCM_FO_S  4
/* MODEM_SYSCON_CLK_MODEM_SEC_BAH_FO : R/W; bitpos: [5]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_FO    (BIT(5))
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_FO_M  (MODEM_SYSCON_CLK_MODEM_SEC_BAH_FO_V << MODEM_SYSCON_CLK_MODEM_SEC_BAH_FO_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_BAH_FO_S  5
/* MODEM_SYSCON_CLK_MODEM_SEC_APB_FO : R/W; bitpos: [6]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_FO    (BIT(6))
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_FO_M  (MODEM_SYSCON_CLK_MODEM_SEC_APB_FO_V << MODEM_SYSCON_CLK_MODEM_SEC_APB_FO_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_APB_FO_S  6
/* MODEM_SYSCON_CLK_MODEM_SEC_AHB_FO : R/W; bitpos: [7]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_SEC_AHB_FO    (BIT(7))
#define MODEM_SYSCON_CLK_MODEM_SEC_AHB_FO_M  (MODEM_SYSCON_CLK_MODEM_SEC_AHB_FO_V << MODEM_SYSCON_CLK_MODEM_SEC_AHB_FO_S)
#define MODEM_SYSCON_CLK_MODEM_SEC_AHB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_MODEM_SEC_AHB_FO_S  7
/* MODEM_SYSCON_CLK_FE_PWDET_ADC_INF_FO : R/W; bitpos: [8]; default: 0; */
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_INF_FO    (BIT(8))
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_INF_FO_M  (MODEM_SYSCON_CLK_FE_PWDET_ADC_INF_FO_V << MODEM_SYSCON_CLK_FE_PWDET_ADC_INF_FO_S)
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_INF_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_INF_FO_S  8
/* MODEM_SYSCON_CLK_FE_DAC_INF_FO : R/W; bitpos: [9]; default: 0; */
#define MODEM_SYSCON_CLK_FE_DAC_INF_FO    (BIT(9))
#define MODEM_SYSCON_CLK_FE_DAC_INF_FO_M  (MODEM_SYSCON_CLK_FE_DAC_INF_FO_V << MODEM_SYSCON_CLK_FE_DAC_INF_FO_S)
#define MODEM_SYSCON_CLK_FE_DAC_INF_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_DAC_INF_FO_S  9
/* MODEM_SYSCON_CLK_FE_APB_FO : R/W; bitpos: [10]; default: 0; */
#define MODEM_SYSCON_CLK_FE_APB_FO    (BIT(10))
#define MODEM_SYSCON_CLK_FE_APB_FO_M  (MODEM_SYSCON_CLK_FE_APB_FO_V << MODEM_SYSCON_CLK_FE_APB_FO_S)
#define MODEM_SYSCON_CLK_FE_APB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_APB_FO_S  10
/* MODEM_SYSCON_CLK_FE_ADC_INF_FO : R/W; bitpos: [11]; default: 0; */
#define MODEM_SYSCON_CLK_FE_ADC_INF_FO    (BIT(11))
#define MODEM_SYSCON_CLK_FE_ADC_INF_FO_M  (MODEM_SYSCON_CLK_FE_ADC_INF_FO_V << MODEM_SYSCON_CLK_FE_ADC_INF_FO_S)
#define MODEM_SYSCON_CLK_FE_ADC_INF_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_ADC_INF_FO_S  11
/* MODEM_SYSCON_CLK_FE_80M_FO : R/W; bitpos: [12]; default: 0; */
#define MODEM_SYSCON_CLK_FE_80M_FO    (BIT(12))
#define MODEM_SYSCON_CLK_FE_80M_FO_M  (MODEM_SYSCON_CLK_FE_80M_FO_V << MODEM_SYSCON_CLK_FE_80M_FO_S)
#define MODEM_SYSCON_CLK_FE_80M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_80M_FO_S  12
/* MODEM_SYSCON_CLK_FE_40M_FO : R/W; bitpos: [13]; default: 0; */
#define MODEM_SYSCON_CLK_FE_40M_FO    (BIT(13))
#define MODEM_SYSCON_CLK_FE_40M_FO_M  (MODEM_SYSCON_CLK_FE_40M_FO_V << MODEM_SYSCON_CLK_FE_40M_FO_S)
#define MODEM_SYSCON_CLK_FE_40M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_40M_FO_S  13
/* MODEM_SYSCON_CLK_FE_20M_FO : R/W; bitpos: [14]; default: 0; */
#define MODEM_SYSCON_CLK_FE_20M_FO    (BIT(14))
#define MODEM_SYSCON_CLK_FE_20M_FO_M  (MODEM_SYSCON_CLK_FE_20M_FO_V << MODEM_SYSCON_CLK_FE_20M_FO_S)
#define MODEM_SYSCON_CLK_FE_20M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_20M_FO_S  14
/* MODEM_SYSCON_CLK_FE_160M_FO : R/W; bitpos: [15]; default: 0; */
#define MODEM_SYSCON_CLK_FE_160M_FO    (BIT(15))
#define MODEM_SYSCON_CLK_FE_160M_FO_M  (MODEM_SYSCON_CLK_FE_160M_FO_V << MODEM_SYSCON_CLK_FE_160M_FO_S)
#define MODEM_SYSCON_CLK_FE_160M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_160M_FO_S  15
/* MODEM_SYSCON_CLK_ETM_FO : R/W; bitpos: [16]; default: 0; */
#define MODEM_SYSCON_CLK_ETM_FO    (BIT(16))
#define MODEM_SYSCON_CLK_ETM_FO_M  (MODEM_SYSCON_CLK_ETM_FO_V << MODEM_SYSCON_CLK_ETM_FO_S)
#define MODEM_SYSCON_CLK_ETM_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_ETM_FO_S  16
/* MODEM_SYSCON_CLK_ETM_APB_FO : R/W; bitpos: [17]; default: 0; */
#define MODEM_SYSCON_CLK_ETM_APB_FO    (BIT(17))
#define MODEM_SYSCON_CLK_ETM_APB_FO_M  (MODEM_SYSCON_CLK_ETM_APB_FO_V << MODEM_SYSCON_CLK_ETM_APB_FO_S)
#define MODEM_SYSCON_CLK_ETM_APB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_ETM_APB_FO_S  17
/* MODEM_SYSCON_CLK_DATA_DUMP_MEM_FO : R/W; bitpos: [18]; default: 0; */
#define MODEM_SYSCON_CLK_DATA_DUMP_MEM_FO    (BIT(18))
#define MODEM_SYSCON_CLK_DATA_DUMP_MEM_FO_M  (MODEM_SYSCON_CLK_DATA_DUMP_MEM_FO_V << MODEM_SYSCON_CLK_DATA_DUMP_MEM_FO_S)
#define MODEM_SYSCON_CLK_DATA_DUMP_MEM_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_DATA_DUMP_MEM_FO_S  18
/* MODEM_SYSCON_CLK_DATA_DUMP_FO : R/W; bitpos: [19]; default: 0; */
#define MODEM_SYSCON_CLK_DATA_DUMP_FO    (BIT(19))
#define MODEM_SYSCON_CLK_DATA_DUMP_FO_M  (MODEM_SYSCON_CLK_DATA_DUMP_FO_V << MODEM_SYSCON_CLK_DATA_DUMP_FO_S)
#define MODEM_SYSCON_CLK_DATA_DUMP_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_DATA_DUMP_FO_S  19
/* MODEM_SYSCON_CLK_BTMAC_FO : R/W; bitpos: [20]; default: 0; */
#define MODEM_SYSCON_CLK_BTMAC_FO    (BIT(20))
#define MODEM_SYSCON_CLK_BTMAC_FO_M  (MODEM_SYSCON_CLK_BTMAC_FO_V << MODEM_SYSCON_CLK_BTMAC_FO_S)
#define MODEM_SYSCON_CLK_BTMAC_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BTMAC_FO_S  20
/* MODEM_SYSCON_CLK_BTMAC_AHB_FO : R/W; bitpos: [21]; default: 0; */
#define MODEM_SYSCON_CLK_BTMAC_AHB_FO    (BIT(21))
#define MODEM_SYSCON_CLK_BTMAC_AHB_FO_M  (MODEM_SYSCON_CLK_BTMAC_AHB_FO_V << MODEM_SYSCON_CLK_BTMAC_AHB_FO_S)
#define MODEM_SYSCON_CLK_BTMAC_AHB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BTMAC_AHB_FO_S  21
/* MODEM_SYSCON_CLK_BT_APB_FO : R/W; bitpos: [22]; default: 0; */
#define MODEM_SYSCON_CLK_BT_APB_FO    (BIT(22))
#define MODEM_SYSCON_CLK_BT_APB_FO_M  (MODEM_SYSCON_CLK_BT_APB_FO_V << MODEM_SYSCON_CLK_BT_APB_FO_S)
#define MODEM_SYSCON_CLK_BT_APB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_APB_FO_S  22
/* MODEM_SYSCON_CLK_BT_APB_32M_FO : R/W; bitpos: [23]; default: 0; */
#define MODEM_SYSCON_CLK_BT_APB_32M_FO    (BIT(23))
#define MODEM_SYSCON_CLK_BT_APB_32M_FO_M  (MODEM_SYSCON_CLK_BT_APB_32M_FO_V << MODEM_SYSCON_CLK_BT_APB_32M_FO_S)
#define MODEM_SYSCON_CLK_BT_APB_32M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_APB_32M_FO_S  23
/* MODEM_SYSCON_CLK_BT_8M_FO : R/W; bitpos: [24]; default: 0; */
#define MODEM_SYSCON_CLK_BT_8M_FO    (BIT(24))
#define MODEM_SYSCON_CLK_BT_8M_FO_M  (MODEM_SYSCON_CLK_BT_8M_FO_V << MODEM_SYSCON_CLK_BT_8M_FO_S)
#define MODEM_SYSCON_CLK_BT_8M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_8M_FO_S  24
/* MODEM_SYSCON_CLK_BT_80M_FO : R/W; bitpos: [25]; default: 0; */
#define MODEM_SYSCON_CLK_BT_80M_FO    (BIT(25))
#define MODEM_SYSCON_CLK_BT_80M_FO_M  (MODEM_SYSCON_CLK_BT_80M_FO_V << MODEM_SYSCON_CLK_BT_80M_FO_S)
#define MODEM_SYSCON_CLK_BT_80M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_80M_FO_S  25
/* MODEM_SYSCON_CLK_BT_40M_FO : R/W; bitpos: [26]; default: 0; */
#define MODEM_SYSCON_CLK_BT_40M_FO    (BIT(26))
#define MODEM_SYSCON_CLK_BT_40M_FO_M  (MODEM_SYSCON_CLK_BT_40M_FO_V << MODEM_SYSCON_CLK_BT_40M_FO_S)
#define MODEM_SYSCON_CLK_BT_40M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_40M_FO_S  26
/* MODEM_SYSCON_CLK_BT_32M_FO : R/W; bitpos: [27]; default: 0; */
#define MODEM_SYSCON_CLK_BT_32M_FO    (BIT(27))
#define MODEM_SYSCON_CLK_BT_32M_FO_M  (MODEM_SYSCON_CLK_BT_32M_FO_V << MODEM_SYSCON_CLK_BT_32M_FO_S)
#define MODEM_SYSCON_CLK_BT_32M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_32M_FO_S  27
/* MODEM_SYSCON_CLK_BT_16M_FO : R/W; bitpos: [28]; default: 0; */
#define MODEM_SYSCON_CLK_BT_16M_FO    (BIT(28))
#define MODEM_SYSCON_CLK_BT_16M_FO_M  (MODEM_SYSCON_CLK_BT_16M_FO_V << MODEM_SYSCON_CLK_BT_16M_FO_S)
#define MODEM_SYSCON_CLK_BT_16M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_16M_FO_S  28
/* MODEM_SYSCON_CLK_BT_160M_FO : R/W; bitpos: [29]; default: 0; */
#define MODEM_SYSCON_CLK_BT_160M_FO    (BIT(29))
#define MODEM_SYSCON_CLK_BT_160M_FO_M  (MODEM_SYSCON_CLK_BT_160M_FO_V << MODEM_SYSCON_CLK_BT_160M_FO_S)
#define MODEM_SYSCON_CLK_BT_160M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_160M_FO_S  29
/* MODEM_SYSCON_CLK_BLE_TIMER_FO : R/W; bitpos: [30]; default: 0; */
#define MODEM_SYSCON_CLK_BLE_TIMER_FO    (BIT(30))
#define MODEM_SYSCON_CLK_BLE_TIMER_FO_M  (MODEM_SYSCON_CLK_BLE_TIMER_FO_V << MODEM_SYSCON_CLK_BLE_TIMER_FO_S)
#define MODEM_SYSCON_CLK_BLE_TIMER_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BLE_TIMER_FO_S  30
/* MODEM_SYSCON_CLK_BLE_TIMER_APB_FO : R/W; bitpos: [31]; default: 0; */
#define MODEM_SYSCON_CLK_BLE_TIMER_APB_FO    (BIT(31))
#define MODEM_SYSCON_CLK_BLE_TIMER_APB_FO_M  (MODEM_SYSCON_CLK_BLE_TIMER_APB_FO_V << MODEM_SYSCON_CLK_BLE_TIMER_APB_FO_S)
#define MODEM_SYSCON_CLK_BLE_TIMER_APB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_BLE_TIMER_APB_FO_S  31

/* MODEM_SYSCON_CLK_CONF_POWER_ST_REG register */
#define MODEM_SYSCON_CLK_CONF_POWER_ST_REG (DR_REG_MODEM_SYSCON_BASE + 0xc)
/* MODEM_SYSCON_CLK_ZB_ST_MAP : R/W; bitpos: [11:8]; default: 0; */
#define MODEM_SYSCON_CLK_ZB_ST_MAP    0x0000000FU
#define MODEM_SYSCON_CLK_ZB_ST_MAP_M  (MODEM_SYSCON_CLK_ZB_ST_MAP_V << MODEM_SYSCON_CLK_ZB_ST_MAP_S)
#define MODEM_SYSCON_CLK_ZB_ST_MAP_V  0x0000000FU
#define MODEM_SYSCON_CLK_ZB_ST_MAP_S  8
/* MODEM_SYSCON_CLK_FE_ST_MAP : R/W; bitpos: [15:12]; default: 0; */
#define MODEM_SYSCON_CLK_FE_ST_MAP    0x0000000FU
#define MODEM_SYSCON_CLK_FE_ST_MAP_M  (MODEM_SYSCON_CLK_FE_ST_MAP_V << MODEM_SYSCON_CLK_FE_ST_MAP_S)
#define MODEM_SYSCON_CLK_FE_ST_MAP_V  0x0000000FU
#define MODEM_SYSCON_CLK_FE_ST_MAP_S  12
/* MODEM_SYSCON_CLK_BT_ST_MAP : R/W; bitpos: [19:16]; default: 0; */
#define MODEM_SYSCON_CLK_BT_ST_MAP    0x0000000FU
#define MODEM_SYSCON_CLK_BT_ST_MAP_M  (MODEM_SYSCON_CLK_BT_ST_MAP_V << MODEM_SYSCON_CLK_BT_ST_MAP_S)
#define MODEM_SYSCON_CLK_BT_ST_MAP_V  0x0000000FU
#define MODEM_SYSCON_CLK_BT_ST_MAP_S  16
/* MODEM_SYSCON_CLK_WIFI_ST_MAP : R/W; bitpos: [23:20]; default: 0; */
#define MODEM_SYSCON_CLK_WIFI_ST_MAP    0x0000000FU
#define MODEM_SYSCON_CLK_WIFI_ST_MAP_M  (MODEM_SYSCON_CLK_WIFI_ST_MAP_V << MODEM_SYSCON_CLK_WIFI_ST_MAP_S)
#define MODEM_SYSCON_CLK_WIFI_ST_MAP_V  0x0000000FU
#define MODEM_SYSCON_CLK_WIFI_ST_MAP_S  20
/* MODEM_SYSCON_CLK_MODEM_PERI_ST_MAP : R/W; bitpos: [27:24]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_PERI_ST_MAP    0x0000000FU
#define MODEM_SYSCON_CLK_MODEM_PERI_ST_MAP_M  (MODEM_SYSCON_CLK_MODEM_PERI_ST_MAP_V << MODEM_SYSCON_CLK_MODEM_PERI_ST_MAP_S)
#define MODEM_SYSCON_CLK_MODEM_PERI_ST_MAP_V  0x0000000FU
#define MODEM_SYSCON_CLK_MODEM_PERI_ST_MAP_S  24
/* MODEM_SYSCON_CLK_MODEM_APB_ST_MAP : R/W; bitpos: [31:28]; default: 0; */
#define MODEM_SYSCON_CLK_MODEM_APB_ST_MAP    0x0000000FU
#define MODEM_SYSCON_CLK_MODEM_APB_ST_MAP_M  (MODEM_SYSCON_CLK_MODEM_APB_ST_MAP_V << MODEM_SYSCON_CLK_MODEM_APB_ST_MAP_S)
#define MODEM_SYSCON_CLK_MODEM_APB_ST_MAP_V  0x0000000FU
#define MODEM_SYSCON_CLK_MODEM_APB_ST_MAP_S  28

