espressif/esp-idf/components/soc/esp32h4/include/modem/modem_syscon_reg.h
/* MODEM_SYSCON_MODEM_RST_CONF_REG register */
#define MODEM_SYSCON_MODEM_RST_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x10)
/* MODEM_SYSCON_RST_FE_TXLOGAIN : R/W; bitpos: [6]; default: 0; */
#define MODEM_SYSCON_RST_FE_TXLOGAIN    (BIT(6))
#define MODEM_SYSCON_RST_FE_TXLOGAIN_M  (MODEM_SYSCON_RST_FE_TXLOGAIN_V << MODEM_SYSCON_RST_FE_TXLOGAIN_S)
#define MODEM_SYSCON_RST_FE_TXLOGAIN_V  0x00000001U
#define MODEM_SYSCON_RST_FE_TXLOGAIN_S  6
/* MODEM_SYSCON_RST_FE_SDM : R/W; bitpos: [7]; default: 0; */
#define MODEM_SYSCON_RST_FE_SDM    (BIT(7))
#define MODEM_SYSCON_RST_FE_SDM_M  (MODEM_SYSCON_RST_FE_SDM_V << MODEM_SYSCON_RST_FE_SDM_S)
#define MODEM_SYSCON_RST_FE_SDM_V  0x00000001U
#define MODEM_SYSCON_RST_FE_SDM_S  7
/* MODEM_SYSCON_RST_WIFIBB : R/W; bitpos: [8]; default: 0; */
#define MODEM_SYSCON_RST_WIFIBB    (BIT(8))
#define MODEM_SYSCON_RST_WIFIBB_M  (MODEM_SYSCON_RST_WIFIBB_V << MODEM_SYSCON_RST_WIFIBB_S)
#define MODEM_SYSCON_RST_WIFIBB_V  0x00000001U
#define MODEM_SYSCON_RST_WIFIBB_S  8
/* MODEM_SYSCON_RST_WIFIMAC : R/W; bitpos: [9]; default: 0; */
#define MODEM_SYSCON_RST_WIFIMAC    (BIT(9))
#define MODEM_SYSCON_RST_WIFIMAC_M  (MODEM_SYSCON_RST_WIFIMAC_V << MODEM_SYSCON_RST_WIFIMAC_S)
#define MODEM_SYSCON_RST_WIFIMAC_V  0x00000001U
#define MODEM_SYSCON_RST_WIFIMAC_S  9
/* MODEM_SYSCON_RST_FE_PWDET_ADC : R/W; bitpos: [10]; default: 0; */
#define MODEM_SYSCON_RST_FE_PWDET_ADC    (BIT(10))
#define MODEM_SYSCON_RST_FE_PWDET_ADC_M  (MODEM_SYSCON_RST_FE_PWDET_ADC_V << MODEM_SYSCON_RST_FE_PWDET_ADC_S)
#define MODEM_SYSCON_RST_FE_PWDET_ADC_V  0x00000001U
#define MODEM_SYSCON_RST_FE_PWDET_ADC_S  10
/* MODEM_SYSCON_RST_FE_DAC : R/W; bitpos: [11]; default: 0; */
#define MODEM_SYSCON_RST_FE_DAC    (BIT(11))
#define MODEM_SYSCON_RST_FE_DAC_M  (MODEM_SYSCON_RST_FE_DAC_V << MODEM_SYSCON_RST_FE_DAC_S)
#define MODEM_SYSCON_RST_FE_DAC_V  0x00000001U
#define MODEM_SYSCON_RST_FE_DAC_S  11
/* MODEM_SYSCON_RST_FE_ADC : R/W; bitpos: [12]; default: 0; */
#define MODEM_SYSCON_RST_FE_ADC    (BIT(12))
#define MODEM_SYSCON_RST_FE_ADC_M  (MODEM_SYSCON_RST_FE_ADC_V << MODEM_SYSCON_RST_FE_ADC_S)
#define MODEM_SYSCON_RST_FE_ADC_V  0x00000001U
#define MODEM_SYSCON_RST_FE_ADC_S  12
/* MODEM_SYSCON_RST_FE_AHB : R/W; bitpos: [13]; default: 0; */
#define MODEM_SYSCON_RST_FE_AHB    (BIT(13))
#define MODEM_SYSCON_RST_FE_AHB_M  (MODEM_SYSCON_RST_FE_AHB_V << MODEM_SYSCON_RST_FE_AHB_S)
#define MODEM_SYSCON_RST_FE_AHB_V  0x00000001U
#define MODEM_SYSCON_RST_FE_AHB_S  13
/* MODEM_SYSCON_RST_FE : R/W; bitpos: [14]; default: 0; */
#define MODEM_SYSCON_RST_FE    (BIT(14))
#define MODEM_SYSCON_RST_FE_M  (MODEM_SYSCON_RST_FE_V << MODEM_SYSCON_RST_FE_S)
#define MODEM_SYSCON_RST_FE_V  0x00000001U
#define MODEM_SYSCON_RST_FE_S  14
/* MODEM_SYSCON_RST_BTMAC_APB : R/W; bitpos: [15]; default: 0; */
#define MODEM_SYSCON_RST_BTMAC_APB    (BIT(15))
#define MODEM_SYSCON_RST_BTMAC_APB_M  (MODEM_SYSCON_RST_BTMAC_APB_V << MODEM_SYSCON_RST_BTMAC_APB_S)
#define MODEM_SYSCON_RST_BTMAC_APB_V  0x00000001U
#define MODEM_SYSCON_RST_BTMAC_APB_S  15
/* MODEM_SYSCON_RST_BTMAC : R/W; bitpos: [16]; default: 0; */
#define MODEM_SYSCON_RST_BTMAC    (BIT(16))
#define MODEM_SYSCON_RST_BTMAC_M  (MODEM_SYSCON_RST_BTMAC_V << MODEM_SYSCON_RST_BTMAC_S)
#define MODEM_SYSCON_RST_BTMAC_V  0x00000001U
#define MODEM_SYSCON_RST_BTMAC_S  16
/* MODEM_SYSCON_RST_BTBB_APB : R/W; bitpos: [17]; default: 0; */
#define MODEM_SYSCON_RST_BTBB_APB    (BIT(17))
#define MODEM_SYSCON_RST_BTBB_APB_M  (MODEM_SYSCON_RST_BTBB_APB_V << MODEM_SYSCON_RST_BTBB_APB_S)
#define MODEM_SYSCON_RST_BTBB_APB_V  0x00000001U
#define MODEM_SYSCON_RST_BTBB_APB_S  17
/* MODEM_SYSCON_RST_BTBB : R/W; bitpos: [18]; default: 0; */
#define MODEM_SYSCON_RST_BTBB    (BIT(18))
#define MODEM_SYSCON_RST_BTBB_M  (MODEM_SYSCON_RST_BTBB_V << MODEM_SYSCON_RST_BTBB_S)
#define MODEM_SYSCON_RST_BTBB_V  0x00000001U
#define MODEM_SYSCON_RST_BTBB_S  18
/* MODEM_SYSCON_RST_COEX_BTMAC_APB : R/W; bitpos: [19]; default: 0; */
#define MODEM_SYSCON_RST_COEX_BTMAC_APB    (BIT(19))
#define MODEM_SYSCON_RST_COEX_BTMAC_APB_M  (MODEM_SYSCON_RST_COEX_BTMAC_APB_V << MODEM_SYSCON_RST_COEX_BTMAC_APB_S)
#define MODEM_SYSCON_RST_COEX_BTMAC_APB_V  0x00000001U
#define MODEM_SYSCON_RST_COEX_BTMAC_APB_S  19
/* MODEM_SYSCON_RST_COEX_BTMAC : R/W; bitpos: [20]; default: 0; */
#define MODEM_SYSCON_RST_COEX_BTMAC    (BIT(20))
#define MODEM_SYSCON_RST_COEX_BTMAC_M  (MODEM_SYSCON_RST_COEX_BTMAC_V << MODEM_SYSCON_RST_COEX_BTMAC_S)
#define MODEM_SYSCON_RST_COEX_BTMAC_V  0x00000001U
#define MODEM_SYSCON_RST_COEX_BTMAC_S  20
/* MODEM_SYSCON_RST_ETM : R/W; bitpos: [22]; default: 0; */
#define MODEM_SYSCON_RST_ETM    (BIT(22))
#define MODEM_SYSCON_RST_ETM_M  (MODEM_SYSCON_RST_ETM_V << MODEM_SYSCON_RST_ETM_S)
#define MODEM_SYSCON_RST_ETM_V  0x00000001U
#define MODEM_SYSCON_RST_ETM_S  22
/* MODEM_SYSCON_RST_ZBMAC_APB : R/W; bitpos: [23]; default: 0; */
#define MODEM_SYSCON_RST_ZBMAC_APB    (BIT(23))
#define MODEM_SYSCON_RST_ZBMAC_APB_M  (MODEM_SYSCON_RST_ZBMAC_APB_V << MODEM_SYSCON_RST_ZBMAC_APB_S)
#define MODEM_SYSCON_RST_ZBMAC_APB_V  0x00000001U
#define MODEM_SYSCON_RST_ZBMAC_APB_S  23
/* MODEM_SYSCON_RST_ZBMAC : R/W; bitpos: [24]; default: 0; */
#define MODEM_SYSCON_RST_ZBMAC    (BIT(24))
#define MODEM_SYSCON_RST_ZBMAC_M  (MODEM_SYSCON_RST_ZBMAC_V << MODEM_SYSCON_RST_ZBMAC_S)
#define MODEM_SYSCON_RST_ZBMAC_V  0x00000001U
#define MODEM_SYSCON_RST_ZBMAC_S  24
/* MODEM_SYSCON_RST_MODEM_ECB : R/W; bitpos: [25]; default: 0; */
#define MODEM_SYSCON_RST_MODEM_ECB    (BIT(25))
#define MODEM_SYSCON_RST_MODEM_ECB_M  (MODEM_SYSCON_RST_MODEM_ECB_V << MODEM_SYSCON_RST_MODEM_ECB_S)
#define MODEM_SYSCON_RST_MODEM_ECB_V  0x00000001U
#define MODEM_SYSCON_RST_MODEM_ECB_S  25
/* MODEM_SYSCON_RST_MODEM_CCM : R/W; bitpos: [26]; default: 0; */
#define MODEM_SYSCON_RST_MODEM_CCM    (BIT(26))
#define MODEM_SYSCON_RST_MODEM_CCM_M  (MODEM_SYSCON_RST_MODEM_CCM_V << MODEM_SYSCON_RST_MODEM_CCM_S)
#define MODEM_SYSCON_RST_MODEM_CCM_V  0x00000001U
#define MODEM_SYSCON_RST_MODEM_CCM_S  26
/* MODEM_SYSCON_RST_MODEM_BAH : R/W; bitpos: [27]; default: 0; */
#define MODEM_SYSCON_RST_MODEM_BAH    (BIT(27))
#define MODEM_SYSCON_RST_MODEM_BAH_M  (MODEM_SYSCON_RST_MODEM_BAH_V << MODEM_SYSCON_RST_MODEM_BAH_S)
#define MODEM_SYSCON_RST_MODEM_BAH_V  0x00000001U
#define MODEM_SYSCON_RST_MODEM_BAH_S  27
/* MODEM_SYSCON_RST_MODEM_SEC : R/W; bitpos: [29]; default: 0; */
#define MODEM_SYSCON_RST_MODEM_SEC    (BIT(29))
#define MODEM_SYSCON_RST_MODEM_SEC_M  (MODEM_SYSCON_RST_MODEM_SEC_V << MODEM_SYSCON_RST_MODEM_SEC_S)
#define MODEM_SYSCON_RST_MODEM_SEC_V  0x00000001U
#define MODEM_SYSCON_RST_MODEM_SEC_S  29
/* MODEM_SYSCON_RST_BLE_TIMER : R/W; bitpos: [30]; default: 0; */
#define MODEM_SYSCON_RST_BLE_TIMER    (BIT(30))
#define MODEM_SYSCON_RST_BLE_TIMER_M  (MODEM_SYSCON_RST_BLE_TIMER_V << MODEM_SYSCON_RST_BLE_TIMER_S)
#define MODEM_SYSCON_RST_BLE_TIMER_V  0x00000001U
#define MODEM_SYSCON_RST_BLE_TIMER_S  30
/* MODEM_SYSCON_RST_DATA_DUMP : R/W; bitpos: [31]; default: 0; */
#define MODEM_SYSCON_RST_DATA_DUMP    (BIT(31))
#define MODEM_SYSCON_RST_DATA_DUMP_M  (MODEM_SYSCON_RST_DATA_DUMP_V << MODEM_SYSCON_RST_DATA_DUMP_S)
#define MODEM_SYSCON_RST_DATA_DUMP_V  0x00000001U
#define MODEM_SYSCON_RST_DATA_DUMP_S  31

/* MODEM_SYSCON_CLK_CONF1_REG register */
#define MODEM_SYSCON_CLK_CONF1_REG (DR_REG_MODEM_SYSCON_BASE + 0x14)
/* MODEM_SYSCON_CLK_WIFIBB_22M_EN : R/W; bitpos: [0]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN    (BIT(0))
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_22M_EN_V << MODEM_SYSCON_CLK_WIFIBB_22M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN_S  0
/* MODEM_SYSCON_CLK_WIFIBB_40M_EN : R/W; bitpos: [1]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN    (BIT(1))
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_40M_EN_V << MODEM_SYSCON_CLK_WIFIBB_40M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN_S  1
/* MODEM_SYSCON_CLK_WIFIBB_44M_EN : R/W; bitpos: [2]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN    (BIT(2))
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_44M_EN_V << MODEM_SYSCON_CLK_WIFIBB_44M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN_S  2
/* MODEM_SYSCON_CLK_WIFIBB_80M_EN : R/W; bitpos: [3]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN    (BIT(3))
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_80M_EN_V << MODEM_SYSCON_CLK_WIFIBB_80M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN_S  3
/* MODEM_SYSCON_CLK_WIFIBB_40X_EN : R/W; bitpos: [4]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN    (BIT(4))
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN_M  (MODEM_SYSCON_CLK_WIFIBB_40X_EN_V << MODEM_SYSCON_CLK_WIFIBB_40X_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN_S  4
/* MODEM_SYSCON_CLK_WIFIBB_80X_EN : R/W; bitpos: [5]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN    (BIT(5))
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN_M  (MODEM_SYSCON_CLK_WIFIBB_80X_EN_V << MODEM_SYSCON_CLK_WIFIBB_80X_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN_S  5
/* MODEM_SYSCON_CLK_WIFIBB_40X1_EN : R/W; bitpos: [6]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN    (BIT(6))
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN_M  (MODEM_SYSCON_CLK_WIFIBB_40X1_EN_V << MODEM_SYSCON_CLK_WIFIBB_40X1_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN_S  6
/* MODEM_SYSCON_CLK_WIFIBB_80X1_EN : R/W; bitpos: [7]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN    (BIT(7))
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN_M  (MODEM_SYSCON_CLK_WIFIBB_80X1_EN_V << MODEM_SYSCON_CLK_WIFIBB_80X1_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN_S  7
/* MODEM_SYSCON_CLK_WIFIBB_160X1_EN : R/W; bitpos: [8]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN    (BIT(8))
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN_M  (MODEM_SYSCON_CLK_WIFIBB_160X1_EN_V << MODEM_SYSCON_CLK_WIFIBB_160X1_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN_S  8
/* MODEM_SYSCON_CLK_WIFIMAC_EN : R/W; bitpos: [9]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIMAC_EN    (BIT(9))
#define MODEM_SYSCON_CLK_WIFIMAC_EN_M  (MODEM_SYSCON_CLK_WIFIMAC_EN_V << MODEM_SYSCON_CLK_WIFIMAC_EN_S)
#define MODEM_SYSCON_CLK_WIFIMAC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIMAC_EN_S  9
/* MODEM_SYSCON_CLK_WIFI_APB_EN : R/W; bitpos: [10]; default: 0; */
#define MODEM_SYSCON_CLK_WIFI_APB_EN    (BIT(10))
#define MODEM_SYSCON_CLK_WIFI_APB_EN_M  (MODEM_SYSCON_CLK_WIFI_APB_EN_V << MODEM_SYSCON_CLK_WIFI_APB_EN_S)
#define MODEM_SYSCON_CLK_WIFI_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFI_APB_EN_S  10
/* MODEM_SYSCON_CLK_FE_20M_EN : R/W; bitpos: [11]; default: 0; */
#define MODEM_SYSCON_CLK_FE_20M_EN    (BIT(11))
#define MODEM_SYSCON_CLK_FE_20M_EN_M  (MODEM_SYSCON_CLK_FE_20M_EN_V << MODEM_SYSCON_CLK_FE_20M_EN_S)
#define MODEM_SYSCON_CLK_FE_20M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_20M_EN_S  11
/* MODEM_SYSCON_CLK_FE_40M_EN : R/W; bitpos: [12]; default: 0; */
#define MODEM_SYSCON_CLK_FE_40M_EN    (BIT(12))
#define MODEM_SYSCON_CLK_FE_40M_EN_M  (MODEM_SYSCON_CLK_FE_40M_EN_V << MODEM_SYSCON_CLK_FE_40M_EN_S)
#define MODEM_SYSCON_CLK_FE_40M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_40M_EN_S  12
/* MODEM_SYSCON_CLK_FE_80M_EN : R/W; bitpos: [13]; default: 0; */
#define MODEM_SYSCON_CLK_FE_80M_EN    (BIT(13))
#define MODEM_SYSCON_CLK_FE_80M_EN_M  (MODEM_SYSCON_CLK_FE_80M_EN_V << MODEM_SYSCON_CLK_FE_80M_EN_S)
#define MODEM_SYSCON_CLK_FE_80M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_80M_EN_S  13
/* MODEM_SYSCON_CLK_FE_160M_EN : R/W; bitpos: [14]; default: 0; */
#define MODEM_SYSCON_CLK_FE_160M_EN    (BIT(14))
#define MODEM_SYSCON_CLK_FE_160M_EN_M  (MODEM_SYSCON_CLK_FE_160M_EN_V << MODEM_SYSCON_CLK_FE_160M_EN_S)
#define MODEM_SYSCON_CLK_FE_160M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_160M_EN_S  14
/* MODEM_SYSCON_CLK_FE_APB_EN : R/W; bitpos: [15]; default: 0; */
#define MODEM_SYSCON_CLK_FE_APB_EN    (BIT(15))
#define MODEM_SYSCON_CLK_FE_APB_EN_M  (MODEM_SYSCON_CLK_FE_APB_EN_V << MODEM_SYSCON_CLK_FE_APB_EN_S)
#define MODEM_SYSCON_CLK_FE_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_APB_EN_S  15
/* MODEM_SYSCON_CLK_BT_APB_EN : R/W; bitpos: [16]; default: 0; */
#define MODEM_SYSCON_CLK_BT_APB_EN    (BIT(16))
#define MODEM_SYSCON_CLK_BT_APB_EN_M  (MODEM_SYSCON_CLK_BT_APB_EN_V << MODEM_SYSCON_CLK_BT_APB_EN_S)
#define MODEM_SYSCON_CLK_BT_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_APB_EN_S  16
/* MODEM_SYSCON_CLK_BTBB_EN : R/W; bitpos: [17]; default: 0; */
#define MODEM_SYSCON_CLK_BTBB_EN    (BIT(17))
#define MODEM_SYSCON_CLK_BTBB_EN_M  (MODEM_SYSCON_CLK_BTBB_EN_V << MODEM_SYSCON_CLK_BTBB_EN_S)
#define MODEM_SYSCON_CLK_BTBB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_BTBB_EN_S  17
/* MODEM_SYSCON_CLK_BTMAC_EN : R/W; bitpos: [18]; default: 0; */
#define MODEM_SYSCON_CLK_BTMAC_EN    (BIT(18))
#define MODEM_SYSCON_CLK_BTMAC_EN_M  (MODEM_SYSCON_CLK_BTMAC_EN_V << MODEM_SYSCON_CLK_BTMAC_EN_S)
#define MODEM_SYSCON_CLK_BTMAC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_BTMAC_EN_S  18
/* MODEM_SYSCON_CLK_FE_PWDET_ADC_EN : R/W; bitpos: [19]; default: 0; */
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN    (BIT(19))
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_M  (MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_V << MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_S)
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_S  19
/* MODEM_SYSCON_CLK_FE_ADC_EN : R/W; bitpos: [20]; default: 0; */
#define MODEM_SYSCON_CLK_FE_ADC_EN    (BIT(20))
#define MODEM_SYSCON_CLK_FE_ADC_EN_M  (MODEM_SYSCON_CLK_FE_ADC_EN_V << MODEM_SYSCON_CLK_FE_ADC_EN_S)
#define MODEM_SYSCON_CLK_FE_ADC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_ADC_EN_S  20
/* MODEM_SYSCON_CLK_FE_DAC_EN : R/W; bitpos: [21]; default: 0; */
#define MODEM_SYSCON_CLK_FE_DAC_EN    (BIT(21))
#define MODEM_SYSCON_CLK_FE_DAC_EN_M  (MODEM_SYSCON_CLK_FE_DAC_EN_V << MODEM_SYSCON_CLK_FE_DAC_EN_S)
#define MODEM_SYSCON_CLK_FE_DAC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_DAC_EN_S  21
/* MODEM_SYSCON_CLK_FE_SDM_EN : R/W; bitpos: [22]; default: 0; */
#define MODEM_SYSCON_CLK_FE_SDM_EN    (BIT(22))
#define MODEM_SYSCON_CLK_FE_SDM_EN_M  (MODEM_SYSCON_CLK_FE_SDM_EN_V << MODEM_SYSCON_CLK_FE_SDM_EN_S)
#define MODEM_SYSCON_CLK_FE_SDM_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_SDM_EN_S  22
/* MODEM_SYSCON_CLK_FE_TXLOGAIN_EN : R/W; bitpos: [23]; default: 0; */
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_EN    (BIT(23))
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_EN_M  (MODEM_SYSCON_CLK_FE_TXLOGAIN_EN_V << MODEM_SYSCON_CLK_FE_TXLOGAIN_EN_S)
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_EN_S  23
/* MODEM_SYSCON_CLK_FE_32M_EN : R/W; bitpos: [24]; default: 0; */
#define MODEM_SYSCON_CLK_FE_32M_EN    (BIT(24))
#define MODEM_SYSCON_CLK_FE_32M_EN_M  (MODEM_SYSCON_CLK_FE_32M_EN_V << MODEM_SYSCON_CLK_FE_32M_EN_S)
#define MODEM_SYSCON_CLK_FE_32M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_32M_EN_S  24
/* MODEM_SYSCON_CLK_FE_16M_EN : R/W; bitpos: [25]; default: 0; */
#define MODEM_SYSCON_CLK_FE_16M_EN    (BIT(25))
#define MODEM_SYSCON_CLK_FE_16M_EN_M  (MODEM_SYSCON_CLK_FE_16M_EN_V << MODEM_SYSCON_CLK_FE_16M_EN_S)
#define MODEM_SYSCON_CLK_FE_16M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_16M_EN_S  25

/* MODEM_SYSCON_WIFI_BB_CFG_REG register */
#define MODEM_SYSCON_WIFI_BB_CFG_REG (DR_REG_MODEM_SYSCON_BASE + 0x18)
/* MODEM_SYSCON_WIFI_BB_CFG : R/W; bitpos: [31:0]; default: 0; */
#define MODEM_SYSCON_WIFI_BB_CFG    0xFFFFFFFFU
#define MODEM_SYSCON_WIFI_BB_CFG_M  (MODEM_SYSCON_WIFI_BB_CFG_V << MODEM_SYSCON_WIFI_BB_CFG_S)
#define MODEM_SYSCON_WIFI_BB_CFG_V  0xFFFFFFFFU
#define MODEM_SYSCON_WIFI_BB_CFG_S  0

/* MODEM_SYSCON_FE_CFG_REG register */
#define MODEM_SYSCON_FE_CFG_REG (DR_REG_MODEM_SYSCON_BASE + 0x1c)
/* MODEM_SYSCON_FE_CFG : R/W; bitpos: [31:0]; default: 0; */
#define MODEM_SYSCON_FE_CFG    0xFFFFFFFFU
#define MODEM_SYSCON_FE_CFG_M  (MODEM_SYSCON_FE_CFG_V << MODEM_SYSCON_FE_CFG_S)
#define MODEM_SYSCON_FE_CFG_V  0xFFFFFFFFU
#define MODEM_SYSCON_FE_CFG_S  0

/* MODEM_SYSCON_MEM_RF1_CONF_REG register */
#define MODEM_SYSCON_MEM_RF1_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x20)
/* MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 10320; */
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL    0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_M  (MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_V << MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_S)
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_S  0

/* MODEM_SYSCON_MEM_RF2_CONF_REG register */
#define MODEM_SYSCON_MEM_RF2_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x24)
/* MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 0; */
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL    0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_M  (MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_V << MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_S)
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_S  0

