espressif/esp-idf/components/soc/esp32h4/include/modem/modem_syscon_reg.h
/* MODEM_SYSCON_BTMAC_CLK_CFG_REG register */
#define MODEM_SYSCON_BTMAC_CLK_CFG_REG (DR_REG_MODEM_SYSCON_BASE + 0x28)
/* MODEM_SYSCON_CLK_BTMAC_LOW_RATE : R/W; bitpos: [0]; default: 0; */
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE    (BIT(0))
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE_M  (MODEM_SYSCON_CLK_BTMAC_LOW_RATE_V << MODEM_SYSCON_CLK_BTMAC_LOW_RATE_S)
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE_V  0x00000001U
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE_S  0

/* MODEM_SYSCON_CLK_CONF_FORCE_ON_2_REG register */
#define MODEM_SYSCON_CLK_CONF_FORCE_ON_2_REG (DR_REG_MODEM_SYSCON_BASE + 0x2c)
/* MODEM_SYSCON_CLK_WIFI_APB_FO : R/W; bitpos: [0]; default: 0; */
#define MODEM_SYSCON_CLK_WIFI_APB_FO    (BIT(0))
#define MODEM_SYSCON_CLK_WIFI_APB_FO_M  (MODEM_SYSCON_CLK_WIFI_APB_FO_V << MODEM_SYSCON_CLK_WIFI_APB_FO_S)
#define MODEM_SYSCON_CLK_WIFI_APB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFI_APB_FO_S  0
/* MODEM_SYSCON_CLK_WIFIBB_160M_X1_FO : R/W; bitpos: [1]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_160M_X1_FO    (BIT(1))
#define MODEM_SYSCON_CLK_WIFIBB_160M_X1_FO_M  (MODEM_SYSCON_CLK_WIFIBB_160M_X1_FO_V << MODEM_SYSCON_CLK_WIFIBB_160M_X1_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_160M_X1_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_160M_X1_FO_S  1
/* MODEM_SYSCON_CLK_WIFIBB_22M_FO : R/W; bitpos: [2]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_22M_FO    (BIT(2))
#define MODEM_SYSCON_CLK_WIFIBB_22M_FO_M  (MODEM_SYSCON_CLK_WIFIBB_22M_FO_V << MODEM_SYSCON_CLK_WIFIBB_22M_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_22M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_22M_FO_S  2
/* MODEM_SYSCON_CLK_WIFIBB_40M_FO : R/W; bitpos: [3]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_40M_FO    (BIT(3))
#define MODEM_SYSCON_CLK_WIFIBB_40M_FO_M  (MODEM_SYSCON_CLK_WIFIBB_40M_FO_V << MODEM_SYSCON_CLK_WIFIBB_40M_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_40M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40M_FO_S  3
/* MODEM_SYSCON_CLK_WIFIBB_40M_X1_FO : R/W; bitpos: [4]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_40M_X1_FO    (BIT(4))
#define MODEM_SYSCON_CLK_WIFIBB_40M_X1_FO_M  (MODEM_SYSCON_CLK_WIFIBB_40M_X1_FO_V << MODEM_SYSCON_CLK_WIFIBB_40M_X1_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_40M_X1_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40M_X1_FO_S  4
/* MODEM_SYSCON_CLK_WIFIBB_40M_X_INT_FO : R/W; bitpos: [5]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_INT_FO    (BIT(5))
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_INT_FO_M  (MODEM_SYSCON_CLK_WIFIBB_40M_X_INT_FO_V << MODEM_SYSCON_CLK_WIFIBB_40M_X_INT_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_INT_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_INT_FO_S  5
/* MODEM_SYSCON_CLK_WIFIBB_44M_FO : R/W; bitpos: [6]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_44M_FO    (BIT(6))
#define MODEM_SYSCON_CLK_WIFIBB_44M_FO_M  (MODEM_SYSCON_CLK_WIFIBB_44M_FO_V << MODEM_SYSCON_CLK_WIFIBB_44M_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_44M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_44M_FO_S  6
/* MODEM_SYSCON_CLK_WIFIBB_80M_FO : R/W; bitpos: [7]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_80M_FO    (BIT(7))
#define MODEM_SYSCON_CLK_WIFIBB_80M_FO_M  (MODEM_SYSCON_CLK_WIFIBB_80M_FO_V << MODEM_SYSCON_CLK_WIFIBB_80M_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_80M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80M_FO_S  7
/* MODEM_SYSCON_CLK_WIFIBB_80M_X1_FO : R/W; bitpos: [8]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_80M_X1_FO    (BIT(8))
#define MODEM_SYSCON_CLK_WIFIBB_80M_X1_FO_M  (MODEM_SYSCON_CLK_WIFIBB_80M_X1_FO_V << MODEM_SYSCON_CLK_WIFIBB_80M_X1_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_80M_X1_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80M_X1_FO_S  8
/* MODEM_SYSCON_CLK_WIFIBB_80M_X_INT_FO : R/W; bitpos: [9]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_INT_FO    (BIT(9))
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_INT_FO_M  (MODEM_SYSCON_CLK_WIFIBB_80M_X_INT_FO_V << MODEM_SYSCON_CLK_WIFIBB_80M_X_INT_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_INT_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_INT_FO_S  9
/* MODEM_SYSCON_CLK_WIFIBB_APB_44M_FO : R/W; bitpos: [10]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_APB_44M_FO    (BIT(10))
#define MODEM_SYSCON_CLK_WIFIBB_APB_44M_FO_M  (MODEM_SYSCON_CLK_WIFIBB_APB_44M_FO_V << MODEM_SYSCON_CLK_WIFIBB_APB_44M_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_APB_44M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_APB_44M_FO_S  10
/* MODEM_SYSCON_CLK_WIFIMAC_AHB_FO : R/W; bitpos: [11]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIMAC_AHB_FO    (BIT(11))
#define MODEM_SYSCON_CLK_WIFIMAC_AHB_FO_M  (MODEM_SYSCON_CLK_WIFIMAC_AHB_FO_V << MODEM_SYSCON_CLK_WIFIMAC_AHB_FO_S)
#define MODEM_SYSCON_CLK_WIFIMAC_AHB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIMAC_AHB_FO_S  11
/* MODEM_SYSCON_CLK_WIFIMAC_FO : R/W; bitpos: [12]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIMAC_FO    (BIT(12))
#define MODEM_SYSCON_CLK_WIFIMAC_FO_M  (MODEM_SYSCON_CLK_WIFIMAC_FO_V << MODEM_SYSCON_CLK_WIFIMAC_FO_S)
#define MODEM_SYSCON_CLK_WIFIMAC_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIMAC_FO_S  12
/* MODEM_SYSCON_CLK_ZBMAC_AHB_FO : R/W; bitpos: [13]; default: 0; */
#define MODEM_SYSCON_CLK_ZBMAC_AHB_FO    (BIT(13))
#define MODEM_SYSCON_CLK_ZBMAC_AHB_FO_M  (MODEM_SYSCON_CLK_ZBMAC_AHB_FO_V << MODEM_SYSCON_CLK_ZBMAC_AHB_FO_S)
#define MODEM_SYSCON_CLK_ZBMAC_AHB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_ZBMAC_AHB_FO_S  13
/* MODEM_SYSCON_CLK_ZBMAC_APB_16M_FO : R/W; bitpos: [14]; default: 0; */
#define MODEM_SYSCON_CLK_ZBMAC_APB_16M_FO    (BIT(14))
#define MODEM_SYSCON_CLK_ZBMAC_APB_16M_FO_M  (MODEM_SYSCON_CLK_ZBMAC_APB_16M_FO_V << MODEM_SYSCON_CLK_ZBMAC_APB_16M_FO_S)
#define MODEM_SYSCON_CLK_ZBMAC_APB_16M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_ZBMAC_APB_16M_FO_S  14
/* MODEM_SYSCON_CLK_ZBMAC_APB_FO : R/W; bitpos: [15]; default: 0; */
#define MODEM_SYSCON_CLK_ZBMAC_APB_FO    (BIT(15))
#define MODEM_SYSCON_CLK_ZBMAC_APB_FO_M  (MODEM_SYSCON_CLK_ZBMAC_APB_FO_V << MODEM_SYSCON_CLK_ZBMAC_APB_FO_S)
#define MODEM_SYSCON_CLK_ZBMAC_APB_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_ZBMAC_APB_FO_S  15
/* MODEM_SYSCON_CLK_ZBMAC_FO : R/W; bitpos: [16]; default: 0; */
#define MODEM_SYSCON_CLK_ZBMAC_FO    (BIT(16))
#define MODEM_SYSCON_CLK_ZBMAC_FO_M  (MODEM_SYSCON_CLK_ZBMAC_FO_V << MODEM_SYSCON_CLK_ZBMAC_FO_S)
#define MODEM_SYSCON_CLK_ZBMAC_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_ZBMAC_FO_S  16
/* MODEM_SYSCON_CLK_WIFIBB_80M_X_FO : R/W; bitpos: [17]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_FO    (BIT(17))
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_FO_M  (MODEM_SYSCON_CLK_WIFIBB_80M_X_FO_V << MODEM_SYSCON_CLK_WIFIBB_80M_X_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80M_X_FO_S  17
/* MODEM_SYSCON_CLK_WIFIBB_40M_X_FO : R/W; bitpos: [18]; default: 0; */
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_FO    (BIT(18))
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_FO_M  (MODEM_SYSCON_CLK_WIFIBB_40M_X_FO_V << MODEM_SYSCON_CLK_WIFIBB_40M_X_FO_S)
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40M_X_FO_S  18
/* MODEM_SYSCON_CLK_FE_ADC_FO : R/W; bitpos: [19]; default: 0; */
#define MODEM_SYSCON_CLK_FE_ADC_FO    (BIT(19))
#define MODEM_SYSCON_CLK_FE_ADC_FO_M  (MODEM_SYSCON_CLK_FE_ADC_FO_V << MODEM_SYSCON_CLK_FE_ADC_FO_S)
#define MODEM_SYSCON_CLK_FE_ADC_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_ADC_FO_S  19
/* MODEM_SYSCON_CLK_FE_TXLOGAIN_INF_FO : R/W; bitpos: [20]; default: 0; */
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_INF_FO    (BIT(20))
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_INF_FO_M  (MODEM_SYSCON_CLK_FE_TXLOGAIN_INF_FO_V << MODEM_SYSCON_CLK_FE_TXLOGAIN_INF_FO_S)
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_INF_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_TXLOGAIN_INF_FO_S  20
/* MODEM_SYSCON_CLK_FE_SDM_INF_FO : R/W; bitpos: [21]; default: 0; */
#define MODEM_SYSCON_CLK_FE_SDM_INF_FO    (BIT(21))
#define MODEM_SYSCON_CLK_FE_SDM_INF_FO_M  (MODEM_SYSCON_CLK_FE_SDM_INF_FO_V << MODEM_SYSCON_CLK_FE_SDM_INF_FO_S)
#define MODEM_SYSCON_CLK_FE_SDM_INF_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_SDM_INF_FO_S  21
/* MODEM_SYSCON_CLK_FE_SDM_FO : R/W; bitpos: [22]; default: 0; */
#define MODEM_SYSCON_CLK_FE_SDM_FO    (BIT(22))
#define MODEM_SYSCON_CLK_FE_SDM_FO_M  (MODEM_SYSCON_CLK_FE_SDM_FO_V << MODEM_SYSCON_CLK_FE_SDM_FO_S)
#define MODEM_SYSCON_CLK_FE_SDM_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_SDM_FO_S  22
/* MODEM_SYSCON_CLK_FE_SDM_DIV4_FO : R/W; bitpos: [23]; default: 0; */
#define MODEM_SYSCON_CLK_FE_SDM_DIV4_FO    (BIT(23))
#define MODEM_SYSCON_CLK_FE_SDM_DIV4_FO_M  (MODEM_SYSCON_CLK_FE_SDM_DIV4_FO_V << MODEM_SYSCON_CLK_FE_SDM_DIV4_FO_S)
#define MODEM_SYSCON_CLK_FE_SDM_DIV4_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_SDM_DIV4_FO_S  23
/* MODEM_SYSCON_CLK_FE_SDM_DIV2_FO : R/W; bitpos: [24]; default: 0; */
#define MODEM_SYSCON_CLK_FE_SDM_DIV2_FO    (BIT(24))
#define MODEM_SYSCON_CLK_FE_SDM_DIV2_FO_M  (MODEM_SYSCON_CLK_FE_SDM_DIV2_FO_V << MODEM_SYSCON_CLK_FE_SDM_DIV2_FO_S)
#define MODEM_SYSCON_CLK_FE_SDM_DIV2_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_SDM_DIV2_FO_S  24
/* MODEM_SYSCON_CLK_FE_16M_FO : R/W; bitpos: [25]; default: 0; */
#define MODEM_SYSCON_CLK_FE_16M_FO    (BIT(25))
#define MODEM_SYSCON_CLK_FE_16M_FO_M  (MODEM_SYSCON_CLK_FE_16M_FO_V << MODEM_SYSCON_CLK_FE_16M_FO_S)
#define MODEM_SYSCON_CLK_FE_16M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_16M_FO_S  25
/* MODEM_SYSCON_CLK_FE_32M_FO : R/W; bitpos: [26]; default: 0; */
#define MODEM_SYSCON_CLK_FE_32M_FO    (BIT(26))
#define MODEM_SYSCON_CLK_FE_32M_FO_M  (MODEM_SYSCON_CLK_FE_32M_FO_V << MODEM_SYSCON_CLK_FE_32M_FO_S)
#define MODEM_SYSCON_CLK_FE_32M_FO_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_32M_FO_S  26

