espressif/esp-idf/components/soc/esp32h4/include/modem/modem_syscon_reg.h
/* MODEM_SYSCON_APB_TIMEOUT_CONF_REG register */
#define MODEM_SYSCON_APB_TIMEOUT_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x30)
/* MODEM_SYSCON_APB_TIMEOUT_THRES : R/W; bitpos: [15:0]; default: 65535; */
#define MODEM_SYSCON_APB_TIMEOUT_THRES    0x0000FFFFU
#define MODEM_SYSCON_APB_TIMEOUT_THRES_M  (MODEM_SYSCON_APB_TIMEOUT_THRES_V << MODEM_SYSCON_APB_TIMEOUT_THRES_S)
#define MODEM_SYSCON_APB_TIMEOUT_THRES_V  0x0000FFFFU
#define MODEM_SYSCON_APB_TIMEOUT_THRES_S  0
/* MODEM_SYSCON_APB_TIMEOUT_PROTECT_EN : R/W; bitpos: [16]; default: 1; */
#define MODEM_SYSCON_APB_TIMEOUT_PROTECT_EN    (BIT(16))
#define MODEM_SYSCON_APB_TIMEOUT_PROTECT_EN_M  (MODEM_SYSCON_APB_TIMEOUT_PROTECT_EN_V << MODEM_SYSCON_APB_TIMEOUT_PROTECT_EN_S)
#define MODEM_SYSCON_APB_TIMEOUT_PROTECT_EN_V  0x00000001U
#define MODEM_SYSCON_APB_TIMEOUT_PROTECT_EN_S  16
/* MODEM_SYSCON_APB_TIMEOUT_INT_CLR : WO; bitpos: [17]; default: 0; */
#define MODEM_SYSCON_APB_TIMEOUT_INT_CLR    (BIT(17))
#define MODEM_SYSCON_APB_TIMEOUT_INT_CLR_M  (MODEM_SYSCON_APB_TIMEOUT_INT_CLR_V << MODEM_SYSCON_APB_TIMEOUT_INT_CLR_S)
#define MODEM_SYSCON_APB_TIMEOUT_INT_CLR_V  0x00000001U
#define MODEM_SYSCON_APB_TIMEOUT_INT_CLR_S  17
/* MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PID : RO; bitpos: [21:18]; default: 0; */
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PID    0x0000000FU
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PID_M  (MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PID_V << MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PID_S)
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PID_V  0x0000000FU
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PID_S  18
/* MODEM_SYSCON_MODEM_APB_TIMEOUT_INT : RO; bitpos: [22]; default: 0; */
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_INT    (BIT(22))
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_INT_M  (MODEM_SYSCON_MODEM_APB_TIMEOUT_INT_V << MODEM_SYSCON_MODEM_APB_TIMEOUT_INT_S)
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_INT_V  0x00000001U
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_INT_S  22

/* MODEM_SYSCON_APB_TIMEOUT_EXCEPTION_ADDR_REG register */
#define MODEM_SYSCON_APB_TIMEOUT_EXCEPTION_ADDR_REG (DR_REG_MODEM_SYSCON_BASE + 0x34)
/* MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PADDR : RO; bitpos: [31:0]; default: 0; */
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PADDR    0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PADDR_M  (MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PADDR_V << MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PADDR_S)
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PADDR_V  0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_APB_TIMEOUT_EXCEPTION_PADDR_S  0

/* MODEM_SYSCON_DATE_REG register */
#define MODEM_SYSCON_DATE_REG (DR_REG_MODEM_SYSCON_BASE + 0x38)
/* MODEM_SYSCON_DATE : R/W; bitpos: [27:0]; default: 37823024; */
#define MODEM_SYSCON_DATE    0x0FFFFFFFU
#define MODEM_SYSCON_DATE_M  (MODEM_SYSCON_DATE_V << MODEM_SYSCON_DATE_S)
#define MODEM_SYSCON_DATE_V  0x0FFFFFFFU
#define MODEM_SYSCON_DATE_S  0

#ifdef __cplusplus
}
#endif
